In [1]:
import pandas as pd
import numpy as np
import datetime
from datetime import datetime, timedelta
import seaborn as sns
import matplotlib.pyplot as plt

import warnings
warnings.simplefilter(action = 'ignore', category = FutureWarning)

In [43]:
df_prices = pd.read_csv('./EDA/data/prices_clean.csv')
df_sales = pd.read_csv('./EDA/data/sales_clean.csv')

In [13]:
print(df_prices.shape)
df_prices.head(1)

(1536776, 5)

   Unnamed: 0              item store_code        date  sell_price
0           0  ACCESORIES_1_001      BOS_1  2013-07-31   11.753875

In [14]:
print(df_sales.shape)
df_sales.head(1)

(1951360, 5)

   Unnamed: 0                      id      store        date  sales
0           0  ACCESORIES_1_001_BOS_1  South_End  2011-01-31      0

In [15]:
del(df_sales["Unnamed: 0"])
del(df_prices["Unnamed: 0"])

### Making new colunm so to merge by it

In [16]:
df_prices["id"] = df_prices["item"] + "_" + df_prices["store_code"]

In [17]:
df_prices.head(1)

               item store_code        date  sell_price                      id
0  ACCESORIES_1_001      BOS_1  2013-07-31   11.753875  ACCESORIES_1_001_BOS_1

### deleting useless colunms so to save RAM memory in our calculations

In [18]:
df_prices.drop(["store_code", "item"], axis = 1, inplace = True)

In [19]:
df_prices = df_prices[["id","date", "sell_price"]]

In [20]:
df_prices.head(1)

                       id        date  sell_price
0  ACCESORIES_1_001_BOS_1  2013-07-31   11.753875

In [24]:
df_sales.head(1)

                       id      store        date  sales
0  ACCESORIES_1_001_BOS_1  South_End  2011-01-31      0

In [25]:
df_market = pd.merge(df_sales,df_prices, on=["id", "date"], how="left")

In [26]:
print(df_market.shape)
df_market.sample(2)

(1951360, 5)

,id,store,date,sales,sell_price
766440,HOME_&_GARDEN_2_101_NYC_3,Tribeca,2014-05-31,0,NaN
624832,HOME_&_GARDEN_1_421_NYC_1,Greenwich_Village,2011-01-31,0,NaN

In [27]:
df_market["sell_price"].isnull().sum()

414584

### deleting nulls on sell_price column as we consider if there isn´t price it is because the item hadn´t arrive yet to the store

In [28]:
df_market.dropna(subset=(["sell_price"]), inplace = True)

In [29]:
df_market

                              id          store        date  sales  sell_price
30        ACCESORIES_1_001_BOS_1      South_End  2013-07-31     10   11.753875
31        ACCESORIES_1_001_BOS_1      South_End  2013-08-31      3   10.985800
32        ACCESORIES_1_001_BOS_1      South_End  2013-09-30      4   10.985800
33        ACCESORIES_1_001_BOS_1      South_End  2013-10-31      4   10.985800
34        ACCESORIES_1_001_BOS_1      South_End  2013-11-30     10   10.985800
...                          ...            ...         ...    ...         ...
1951355  SUPERMARKET_3_827_PHI_3  Queen_Village  2015-12-31     41    1.200000
1951356  SUPERMARKET_3_827_PHI_3  Queen_Village  2016-01-31     49    1.200000
1951357  SUPERMARKET_3_827_PHI_3  Queen_Village  2016-02-29     46    1.200000
1951358  SUPERMARKET_3_827_PHI_3  Queen_Village  2016-03-31     68    1.200000
1951359  SUPERMARKET_3_827_PHI_3  Queen_Village  2016-04-30     15    1.200000

[1536776 rows x 5 columns]

###  Making new columns "Income"

In [30]:
df_market["income"] = df_market["sales"] * df_market["sell_price"]

In [31]:
df_market.sample(5)

,id,store,date,sales,sell_price,income
634025,HOME_&_GARDEN_1_435_NYC_4,Brooklyn,2014-06-30,8,9.9750,79.8000
731635,HOME_&_GARDEN_2_047_BOS_2,Roxbury,2015-04-30,7,4.5875,32.1125
1323439,SUPERMARKET_2_241_PHI_2,Yorktown,2014-12-31,173,2.8560,494.0880
379836,HOME_&_GARDEN_1_029_NYC_2,Harlem,2016-01-31,30,9.3500,280.5000
753530,HOME_&_GARDEN_2_081_NYC_1,Greenwich_Village,2015-11-30,16,3.2125,51.4000

### adding old columns to our df_market so to use them in visualizations or any other calculates afterwards

In [38]:
df_market["category"] = df_market["id"].apply(lambda x: x[:-12])
df_market["region"] = df_market["id"].apply(lambda x: x[-5:-2])
df_market["item"] = df_market["id"].apply(lambda x: x[0:-6])

In [40]:
df_market = df_market[['id','item','store','region','category','sell_price','sales','income']]

In [41]:
df_market.sample(2)

,id,item,store,region,category,sell_price,sales,income
116331,ACCESORIES_1_187_PHI_1,ACCESORIES_1_187,Midtown_Village,PHI,ACCESORIES,9.3100,5,46.550
787013,HOME_&_GARDEN_2_133_PHI_1,HOME_&_GARDEN_2_133,Midtown_Village,PHI,HOME_&_GARDEN,6.2125,10,62.125

In [77]:
# file_name = "df_market.csv" #mountly
# df_market.to_csv(file_name)